
/* 
* Правило вычисления определителя третьего порядка называет-
* ся правилом Саррюса или правилом треугольников
*/

#include <iostream>

int main()
{
    int a[9];

    std::cout << "Введите 9 чисел по очереди, нажимая enter после каждого:\n";

    for (int i=0;i<9;i++) 
    {
        std::cin >> a[i];
    }

    std::cout << "Получилась матрица:\n";

    for (int i=1;i<10;i++)
    {
        std::cout << a[i-1];
        std::cout << " ";
        if (i%3 == 0){
            std::cout << "\n";
        }
    }

    int det;

    det = a[0]*a[4]*a[8]+
        a[1]*a[5]*a[6]+
        a[2]*a[3]*a[7]-
        a[2]*a[4]*a[6]-
        a[5]*a[7]*a[0]-
        a[1]*a[3]*a[8];

    std::cout << "Определитель матрицы:\n";
    std::cout << det;
    std::cout << "\n";
}